Repository: git102347501/HiNote
Catalog: winui3/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# ListDetails_NoSelection.Text
source: Select an item from the list.
zh_cn: 从列表中选择项目

# Shell_ListDetails.Content
source: Note
zh_cn: 笔记本

# WebView_Loading.Text
source: Loading...
zh_cn: 加载中...

# WebView_FailedMessage.Text
source: Page failed to load. Check connection and reload.
zh_cn: 页面加载失败，检查连接并重新加载

# BrowserBackButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Browser back
zh_cn: 浏览器返回

# BrowserBackButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Browser back
zh_cn: 浏览器返回

# BrowserForwardButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Browser forward
zh_cn: 浏览器向前

source: Browser forward
zh_cn: 浏览器向前

# WebView_Reload.Content
source: Reload
zh_cn: 重新加载

# ReloadButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Reload
zh_cn: 重新加载

# ReloadButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Reload
zh_cn: 重新加载

# OpenInBrowserButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Open in browser
zh_cn: 在浏览器中打开

source: Open in browser
zh_cn: 在浏览器中打开

# Shell_WebView.Content
source: About
zh_cn: 关于

# Settings_Personalization.Text
source: Personalization
zh_cn: 个性化

# Settings_Theme.Text
source: Theme
zh_cn: 主题

# Settings_Theme_Light.Content
source: Light
zh_cn: 明亮模式

# Settings_Theme_Dark.Content
source: Dark
zh_cn: 暗黑模式

# Settings_Theme_Default.Content
source: Default
zh_cn: 默认模式

# Settings_About.Text
source: About this application
zh_cn: 关于

# Settings_AboutDescription.Text
source: TODO: Replace with your app description.
zh_cn: 基于Winui3设计的全新win11原生笔记应用

# SettingsPage_PrivacyTermsLink.Content
source: Privacy Statement
zh_cn: 隐私声明

# LoginPageLoginBtn
source: Login
zh_cn: 登录

# LoginPageLoginBtnLoading
source: Signing in...
zh_cn: 登录中...

# LoginPageRegisterBtn
source: Register Now
zh_cn: 立即注册

# LoginPageRegisterBtnLoading
source: Registering...
zh_cn: 注册中...

# LoginPageRegisterDialogAgree
source: Please Confirm Read And Agreed User Agreement
zh_cn: 请确认您已阅读并同意用户协议

# LoginPageRegisterDialogAgreeCheck
source: Please confirm that you have read and agreed to the user agreement
zh_cn: 请确认您已阅读并同意用户协议

# LoginPageRegisterDialogClose
source: Cancel
zh_cn: 取消

# LoginPageRegisterDialogConfirm
source: Confirm
zh_cn: 确认

# LoginPageRegisterDialogPhone
source: Please enter a valid 11-digit mobile phone number
zh_cn: 请输入11位有效手机号码

# LoginPageRegisterDialogPhoneCheck1
source: Please enter a valid 11-digit mobile phone number
zh_cn: 请输入11位有效手机号码

# LoginPageRegisterDialogPwd
source: Please enter a valid password of 6-24 digits
zh_cn: 请输入6-24位有效密码

# LoginPageRegisterDialogPwdCheck1
source: The two passwords must be consistent
zh_cn: 两次输入密码必须一致

# LoginPageRegisterDialogPwdCheck2
source: Please input a password
zh_cn: 请输入密码

# LoginPageRegisterDialogPwdCheck3
source: Please enter the confirmation password
zh_cn: 请输入确认密码

# LoginPageRegisterDialogPwdCheck4
source: The password is a combination of 6-24 digits, uppercase and lowercase letters and special characters
zh_cn: 密码为6-24位数字大小写字母和特殊字符组合

# LoginPageRegisterDialogSuccess
source: Registration succeeded!
zh_cn: 注册成功!

# LoginPageRegisterDialogTitle
source: Please enter the account number
zh_cn: 请输入账号

# LoginPage_Account.Header
source: Please Input Your Phone Number:
zh_cn: 请输入您的手机号码:

# LoginPage_Account.PlaceholderText
source: Phone Number
zh_cn: 手机号码

# LoginPage_Agree_Label.Content
source: I Have Read and Agree
zh_cn: 我已阅读并同意

# LoginPage_Agree_Link.Content
source: Software User Agreement
zh_cn: 《软件用户协议》

# LoginPage_Form_AgreeBtn.Content
source: Software User Agreement
zh_cn: 《软件用户协议》

# LoginPage_Form_AgreeCheck.Content
source: I Have Read and Agree
zh_cn: 我已阅读并同意

# LoginPage_Form_Phone.Header
source: Please enter your mobile number:
zh_cn: 请输入您的手机号码:

# LoginPage_Form_Phone.PlaceholderText
source: Phone number
zh_cn: 手机号码

# LoginPage_Form_Pwd.Header
source: Please enter your password
zh_cn: 请输入您的密码

# LoginPage_Form_Pwd.PlaceholderText
source: Contains numeric,uppercase,lowercase,letters,special symbols
zh_cn: 包含数字大小写字母和特殊符号

# LoginPage_Form_RetryPwd.Header
source: Please enter your password again
zh_cn: 请再次输入您的密码

# LoginPage_Form_RetryPwd.PlaceholderText
source: Please enter your password again
zh_cn: 请再次输入您的密码

# LoginPage_GoReigster.Content
source: No account? Register Now
zh_cn: 没有账号？立即注册

# LoginPage_Pwd.Header
source: Please Input Your PassWord:
zh_cn: 请输入您的密码:

# LoginPage_Pwd.PlaceholderText
source: PassWord
zh_cn: 密码

# LoginPage_RegisterAccount.Text
source: Register
zh_cn: 注册账户

# NoteListPage_Category_Add.Text
source: Add
zh_cn: 添加

# NoteListPage_Category_DataNull.Text
source: The Current Data is empty
zh_cn: 当前目录为空

# NoteListPage_Note_Add.Text
source: Add
zh_cn: 添加

# NoteListPage_Note_DataNull.Text
source: The Current Data is empty
zh_cn: 当前日记列表为空

# AddCategoryPage_AddCategoryName.Text
source: Input Category Name
zh_cn: 请输入类别名称

source: Cancel
zh_cn: 取消

source: Confirm
zh_cn: 确认

source: Delete
zh_cn: 删除

source: Edit
zh_cn: 编辑

# NoteListMoveCategoryText
source: Move Directory
zh_cn: 移动目录

# NoteListPageAddCategory
source: Input Category Name
zh_cn: 请输入类别名称

# NoteListPageAddCategoryChild
source: Input Subcategory Name
zh_cn: 请输入子类别名称

# NoteListPageAddCategoryChildMsg
source: Add Subcategory
zh_cn: 添加子类别

# NoteListPageAddCategoryMsg
source: Add Category
zh_cn: 添加类别

# NoteListPageAddNote
source: Add Note
zh_cn: 添加文章

# NoteListPageDeleteCategoryMsg
source: Confirm to delete:
zh_cn: 确认要删除:

# NoteListPageEditCategoryMsg
source: Edit Category
zh_cn: 编辑目录信息

# NoteListPageMoveCategory
source: Move to the Directory
zh_cn: 移动到指定目录

# NoteListPageNoteSaveFailBtn
source: Confirm
zh_cn: 确认

# NoteListPageNoteSaveFailMsg
source: Save failed
zh_cn: 保存失败

# NoteListPage_Note_ContentInput.PlaceholderText
source: Input Note Content
zh_cn: 请输入正文

source: Save Note
zh_cn: 保存文章

# NoteListPage_Note_Save.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Save Note (Ctrl+S)
zh_cn: 保存文章(Ctrl + S)

source: Saving
zh_cn: 正在保存

source: Saving...
zh_cn: 正在保存

# NoteListPage_Note_Search.Text
source: Search:
zh_cn: 搜索:

# NoteListPage_Note_SearchInput.PlaceholderText
source: Input Search Content
zh_cn: 请输入搜索内容

# NoteListPage_Note_TitleInput.PlaceholderText
source: Input Note Title
zh_cn: 请输入标题

source: Save
zh_cn: 保存

# SelectTreeViewPage_DataNull.Text
source: The Current Data is empty
zh_cn: 当前目录为空

# Settings_Language.Text
source: Language Setting
zh_cn: 语言设置

# Settings_Language_en_us.Content
source: English
zh_cn: 英语

# Settings_Language_Theme.Text
source: Software Language (Restart the software to take effect after setting)
zh_cn: 软件语言 (设置后重启软件生效)

# UserInfoPage_Close.Content
source: Close
zh_cn: 关闭

# UserInfoPage_Logout.Content
source: Log off
zh_cn: 注销

# UserInfoPage_Phone.Text
source: PhoneNumber:
zh_cn: 手机号码:

# UserInfoPage_UserName.Text
source: UserName:
zh_cn: 用户名:

source: Choice Editor
zh_cn: 切换编辑器

# SelectEditDialogTitle
source: Switching editor type will empty existing content
zh_cn: 切换编辑器类型将清空现有内容

# NoteAIDialogTitle
source: Please enter AI instruction
zh_cn: 请输入AI指令

# NoteAIDialogPlaceholderText
source: Input instructions (translation, sorting list, etc.)
zh_cn: 输入指令，例如（翻译，整理清单等）

source: AI
zh_cn: AI处理

# NoteListPage_Note_Ai.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: AI
zh_cn: 请求AI处理文字内容

# UserInfoPage_AILable.Text
source: Remaining amount of AI:
zh_cn: AI剩余额度:

# UserInfoPage_AICount.Text
source: Surplus:
zh_cn: 剩余:

# UserInfoPage_UsedCount.Text
source: Used:
zh_cn: 已用:

# UserInfoDialogTitle
source: UserInfo
zh_cn: 用户资料

# UserInfoPage_KeyTitle
source: Recharge code exchange
zh_cn: 充值码兑换

# UserInfoPage_Exchange.Content
source: Exchange
zh_cn: 兑换

# UserInfoPage_ExchangeLable.Text
source: Exchange Quota
zh_cn: 兑换额度:

# UserInfoPage_ExchangeMsg.Text
source: Please enter the correct exchange code
zh_cn: 请输入正确的兑换码

# UserInfoPageExchangeErrorMsg
source: Incorrect format of exchange code
zh_cn: 兑换码格式有误

# UserInfoPageExchangeLoadingMsg
source: Verifying...
zh_cn: 正在验证...

# UserInfoPageExchangeSuccessMsg
source: Redemption succeeded
zh_cn: 兑换成功

# UserInfoPageExchangeValidMsg
source: Invalid exchange code
zh_cn: 兑换码无效

source: Log out
zh_cn: 注销

# UserInfoPage_ExchangeBuy.Content
source: Buy Exchange Code
zh_cn: 购买兑换卡

source: Close
zh_cn: 关闭
